package com.mountain.common.util.response;

/**
 * @author chzz
 * @version V1.0
 * @Title:
 * @Package GlobalStatusCode
 * @Description: TODO 系统－全局返回状态码
 * @date 2019/2/23
 */

public enum GlobalStatusCode {

	CODE_200(21020000, "操作成功"),

	CODE_401(401, "token认证失败"),
    CODE_402(402, "token签名错误"),

    CODE_400000(400000, "参数语法格式错误"),
	CODE_400001(400001, "身份验证不通过，请重新登录"),
	CODE_400002(400002, "参数错误"),
	CODE_400003(400003, "token过期或未授权,服务器拒绝执行"),
	CODE_400004(400004, "错误的请求"),
	CODE_400005(400005, "明文不能为空!"),
	CODE_400006(400006, "密文不能为空!"),
	CODE_400008(400008, "请求超时,请重试"),
	CODE_400009(400009, "上传图片过大，请上传小于3M的图片"),
	CODE_400010(400010, "图片上传失败,请重试"),
	CODE_400011(400011, "暂无数据"),
	CODE_400012(400012, "网络出了点小问题，请重试!"),
	CODE_400013(400013, "请求消息体过大"),
	CODE_400014(400014, "消息读取失败"),
	CODE_400015(400015, "token不存在"),
    CODE_400016(400016, "注册账号已经存在"),
    CODE_400017(400017, "还存在子菜单，不能被删除"),
    CODE_400018(400018, "不是同一个对象.无法合并"),

    CODE_500000(500000, "服务器忙,请稍后再试！"),
	CODE_500001(500001, "验证码错误！"),
    CODE_500002(500002, "账号或密码不能为空！"),
    CODE_500003(500003, "账号或密码错误！"),
    CODE_500004(500004, "手机号码不存在！"),
    CODE_500005(500005, "学生号不存在！"),
	CODE_500006(500006, "两次密码不一致！"),
	CODE_500007(500007, "手机号码已被注册！"),

    CODE_700000(700000, "scope参数填写错误，只允许二个值  snsapi_base和snsapi_userinfo"),
    CODE_700001(700001, "code或appid错误"),
    CODE_700002(700002, "发送类型选择错误"),
	CODE_700003(700003, "创建订单失败"),
	CODE_700004(700004, "获取支付信息失败."),
	CODE_700005(700005, "获取token失败."),

	CODE_80000(800000, "防御性校验"),
	CODE_80001(800001, "数据已存在"),
	CODE_80002(800002, "数据已不存在"),
	CODE_80003(800003, "数据不存在"),
	CODE_80004(800004,"数据超时无效"),
	CODE_80005(80005, "用户尚未授权"),
	CODE_50000(500000, "服务其内部出错"),
	CODE_50001(500001,"暂无数据");

    // 成员变量
	private int code;
	private String value;

	// 构造方法
	GlobalStatusCode(int code, String value) {
		this.code = code;
		this.value = value;
	}

	public int code() {
		return this.code;
	}

	public String value() {
		return this.value;
	}
}
